In [1]:
!pip install word2number
import pandas as pd
import numpy as np
from sklearn import linear_model
import warnings
warnings.filterwarnings('ignore')
import word2number
from word2number import w2n

Requirement already satisfied: word2number in c:\users\ronak\anaconda3\lib\site-packages (1.1)

[notice] A new release of pip available: 22.3.1 -> 23.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
df=pd.read_csv('hiring.csv')
df

  experience  test_score  interview_score(out of 10)  salary_indollar
0        NaN         8.0                           9            50000
1        NaN         8.0                           6            45000
2       five         6.0                           7            60000
3        two        10.0                          10            65000
4      seven         9.0                           6            70000
5      three         7.0                          10            62000
6        ten         NaN                           7            72000
7     eleven         7.0                           8            80000

In [3]:
df['experience']=df.experience.fillna('zero')
df

  experience  test_score  interview_score(out of 10)  salary_indollar
0       zero         8.0                           9            50000
1       zero         8.0                           6            45000
2       five         6.0                           7            60000
3        two        10.0                          10            65000
4      seven         9.0                           6            70000
5      three         7.0                          10            62000
6        ten         NaN                           7            72000
7     eleven         7.0                           8            80000

In [4]:
df['experience'] = df.experience.apply(w2n.word_to_num)
df

   experience  test_score  interview_score(out of 10)  salary_indollar
0           0         8.0                           9            50000
1           0         8.0                           6            45000
2           5         6.0                           7            60000
3           2        10.0                          10            65000
4           7         9.0                           6            70000
5           3         7.0                          10            62000
6          10         NaN                           7            72000
7          11         7.0                           8            80000

In [11]:
import math
median_testscore=math.floor(df.test_score.median())
print(median_testscore)
df.test_score=df.test_score.fillna(median_testscore)
df

8

   experience  test_score  interview_score(out of 10)  salary_indollar
0           0         8.0                           9            50000
1           0         8.0                           6            45000
2           5         6.0                           7            60000
3           2        10.0                          10            65000
4           7         9.0                           6            70000
5           3         7.0                          10            62000
6          10         8.0                           7            72000
7          11         7.0                           8            80000

In [6]:
reg=linear_model.LinearRegression()

In [8]:
reg.fit(df[['experience','test_score','interview_score(out of 10)']],df.salary_indollar)

LinearRegression()

In [9]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [12]:
reg.intercept_

17737.263464337688

In [10]:
reg.predict([[2,9,6]])

array([53205.96797671])

In [14]:
2812.95487627*2+1845.70596798*9+2205.24017467*6+17737.263464337688

53205.96797671769